IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_EQEP1_CONTROLSS_EQEP1.xml
<module name="CONTROLSS_EQEP1_CONTROLSS_EQEP1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_EQEP1_QPOSCNT" acronym="CONTROLSS_EQEP1_QPOSCNT" offset="0x0" width="32" description="">
		<bitfield id="QPOSCNT" width="32" begin="31" end="0" resetval="0x0" description="Position Counter  This 32-bit position counter register counts up/down on every eQEP pulse based on direction input. This counter acts as a position integrator whose count value is proportional to position from a give reference point. This Register acts as a Read ONLY register while counter is counting up/down.  Note: It is recommended to only write to the position counter register (QPOSCNT) during initialization, i.e. when the eQEP position counter is disabled (QPEN bit of QEPCTL is zero). Once the position counter is enabled (QPEN bit is one), writing to the eQEP position counter register (QPOSCNT) may cause unexpected results." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QPOSINIT" acronym="CONTROLSS_EQEP1_QPOSINIT" offset="0x4" width="32" description="">
		<bitfield id="QPOSINIT" width="32" begin="31" end="0" resetval="0x0" description="Position Counter Init This register contains the position value that is used to initialize the position counter based on external strobe or index event. The position counter can be initialized through software. Writes to this register should always be full 32-bit writes." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QPOSMAX" acronym="CONTROLSS_EQEP1_QPOSMAX" offset="0x8" width="32" description="">
		<bitfield id="QPOSMAX" width="32" begin="31" end="0" resetval="0x0" description="Maximum Position Count This register contains the maximum position counter value. Writes to this register should always be full 32-bit writes." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QPOSCMP" acronym="CONTROLSS_EQEP1_QPOSCMP" offset="0xC" width="32" description="">
		<bitfield id="QPOSCMP" width="32" begin="31" end="0" resetval="0x0" description="Position Compare  The position-compare value in this register is compared with the position counter (QPOSCNT) to generate sync output and/or interrupt on compare match." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QPOSILAT" acronym="CONTROLSS_EQEP1_QPOSILAT" offset="0x10" width="32" description="">
		<bitfield id="QPOSILAT" width="32" begin="31" end="0" resetval="0x0" description="Index Position Latch   The position-counter value is latched into this register on an index event as defined by the QEPCTL[IEL] bits." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP1_QPOSSLAT" acronym="CONTROLSS_EQEP1_QPOSSLAT" offset="0x14" width="32" description="">
		<bitfield id="QPOSSLAT" width="32" begin="31" end="0" resetval="0x0" description="Strobe Position Latch   The position-counter value is latched into this register on a strobe event as defined by the QEPCTL[SEL] bits." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP1_QPOSLAT" acronym="CONTROLSS_EQEP1_QPOSLAT" offset="0x18" width="32" description="">
		<bitfield id="QPOSLAT" width="32" begin="31" end="0" resetval="0x0" description="Position Latch   The position-counter value is latched into this register on a unit time out event." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP1_QUTMR" acronym="CONTROLSS_EQEP1_QUTMR" offset="0x1C" width="32" description="">
		<bitfield id="QUTMR" width="32" begin="31" end="0" resetval="0x0" description="QEP Unit Timer This register acts as time base for unit time event generation. When this timer value matches the unit time period value a unit time event is generated." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QUPRD" acronym="CONTROLSS_EQEP1_QUPRD" offset="0x20" width="32" description="">
		<bitfield id="QUPRD" width="32" begin="31" end="0" resetval="0x0" description="QEP Unit Period This register contains the period count for the unit timer to generate periodic unit time events. These events latch the eQEP position information at periodic intervals and optionally generate an interrupt. Writes to this register should always be full 32-bit writes." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QWDTMR" acronym="CONTROLSS_EQEP1_QWDTMR" offset="0x24" width="16" description="">
		<bitfield id="QWDTMR" width="16" begin="15" end="0" resetval="0x0" description="QEP Watchdog Timer  This register acts as time base for the watchdog to detect motor stalls. When this timer value matches with the watchdog's period value a watchdog timeout interrupt is generated. This register is reset upon edge transition in quadrature-clock indicating the motion." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QWDPRD" acronym="CONTROLSS_EQEP1_QWDPRD" offset="0x26" width="16" description="">
		<bitfield id="QWDPRD" width="16" begin="15" end="0" resetval="0x0" description="QEP Watchdog Period  This register contains the time-out count for the eQEP peripheral watch dog timer. When the watchdog timer value matches the watchdog period value, a watchdog timeout interrupt is generated." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QDECCTL" acronym="CONTROLSS_EQEP1_QDECCTL" offset="0x28" width="16" description="">
		<bitfield id="QSRC" width="2" begin="15" end="14" resetval="0x0" description="Position-counter source selection" range="15 - 14" rwaccess="RW"/> 
		<bitfield id="SOEN" width="1" begin="13" end="13" resetval="0x0" description="Sync output-enable    0   |   SYNC_DISABLEDisable position-compare sync output      1   |   SYNC_ENABLEEnable position-compare sync output  " range="13" rwaccess="RW"/> 
		<bitfield id="SPSEL" width="1" begin="12" end="12" resetval="0x0" description="Sync output pin selection    0   |   INDEX_PINIndex pin is used for sync output      1   |   STROBE_PINStrobe pin is used for sync output  " range="12" rwaccess="RW"/> 
		<bitfield id="XCR" width="1" begin="11" end="11" resetval="0x0" description="External Clock Rate    0   |   XCR_2XRESOL2x resolution: Count the rising/falling edge      1   |   XCR_1XRESOL1x resolution: Count the rising edge only  " range="11" rwaccess="RW"/> 
		<bitfield id="SWAP" width="1" begin="10" end="10" resetval="0x0" description="CLK/DIR Signal Source for Position Counter    0   |   SWAP_DISABLEQuadrature-clock inputs are not swapped      1   |   SWAP_ENABLEQuadrature-clock inputs are swapped  " range="10" rwaccess="RW"/> 
		<bitfield id="IGATE" width="1" begin="9" end="9" resetval="0x0" description="Index pulse gating option    0   |   IGATE_DISABLEDisable gating of Index pulse      1   |   IGATE_ENABLEGate the index pin with strobe  " range="9" rwaccess="RW"/> 
		<bitfield id="QAP" width="1" begin="8" end="8" resetval="0x0" description="QEPA input polarity    0   |   QAP_NOPOLARNo effect      1   |   QAP_POLARNegates QEPA input  " range="8" rwaccess="RW"/> 
		<bitfield id="QBP" width="1" begin="7" end="7" resetval="0x0" description="QEPB input polarity    0   |   QBP_NOPOLARNo effect      1   |   QBP_POLARNegates QEPB input  " range="7" rwaccess="RW"/> 
		<bitfield id="QIP" width="1" begin="6" end="6" resetval="0x0" description="QEPI input polarity    0   |   QIP_NOPOLARNo effect      1   |   QIP_POLARNegates QEPI input  " range="6" rwaccess="RW"/> 
		<bitfield id="QSP" width="1" begin="5" end="5" resetval="0x0" description="QEPS input polarity    0   |   QSP_NOPOLARNo effect      1   |   QSP_POLARNegates QEPS input  " range="5" rwaccess="RW"/> 
		<bitfield id="QIDIRE" width="1" begin="0" end="0" resetval="0x0" description="0 - Compatible mode, Behavior same as existing devices 1 - Enhancement for Direction change during Index will be enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QEPCTL" acronym="CONTROLSS_EQEP1_QEPCTL" offset="0x2A" width="16" description="">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation mode    0x0   |   FREE_SOFT_0QPOSCNT behavior Position counter stops immediately on emulation suspend 0h (R/W) = QWDTMR behavior Watchdog counter stops immediately 0h (R/W) = QUTMR behavior Unit timer stops immediately 0h (R/W) = QCTMR behavior Capture Timer stops immediately      0x1   |   FREE_SOFT_1QPOSCNT behavior Position counter continues to count until the rollover 1h (R/W) = QWDTMR behavior Watchdog counter counts until WD period match roll over 1h (R/W) = QUTMR behavior Unit timer counts until period rollover 1h (R/W) = QCTMR behavior Capture Timer counts until next unit period event      0x2   |   FREE_SOFT_2QPOSCNT behavior Position counter is unaffected by emulation suspend 2h (R/W) = QWDTMR behavior Watchdog counter is unaffected by emulation suspend 2h (R/W) = QUTMR behavior Unit timer is unaffected by emulation suspend 2h (R/W) = QCTMR behavior Capture Timer is unaffected by emulation suspend      0x3   |   FREE_SOFT_3Same as FREE_SOFT_2  " range="15 - 14" rwaccess="RW"/> 
		<bitfield id="PCRM" width="2" begin="13" end="12" resetval="0x0" description="Postion counter reset    0x0   |   PCRM_INDEXPosition counter reset on an index event      0x1   |   PCRM_MAXPOSPosition counter reset on the maximum position      0x2   |   PCRM_FIRSTINDEXPosition counter reset on the first index event      0x3   |   PCRM_TIMEEVENTPosition counter reset on a unit time event  " range="13 - 12" rwaccess="RW"/> 
		<bitfield id="SEI" width="2" begin="11" end="10" resetval="0x0" description="Strobe event initialization of position counter    0x0   |   SEI_NOTHING0Does nothing (action disabled)      0x1   |   SEI_NOTHING1Does nothing (action disabled)      0x2   |   SEI_INITQEPSRISINGInitializes the position counter on rising edge of the QEPS signal      0x3   |   SEI_INITQEPSCLOCKClockwise Direction: Initializes the position counter on the rising edge of QEPS strobe Counter Clockwise Direction: Initializes the position counter on the falling edge of QEPS strobe  " range="11 - 10" rwaccess="RW"/> 
		<bitfield id="IEI" width="2" begin="9" end="8" resetval="0x0" description="Index event init of position count    0x0   |   IEI_NOTHING0Do nothing (action disabled)      0x1   |   IEI_NOTHING1Do nothing (action disabled)      0x2   |   IEI_INITRISINGInitializes the position counter on the rising edge of the QEPI signal (QPOSCNT = QPOSINIT)      0x3   |   IEI_INITFALLINGInitializes the position counter on the falling edge of QEPI signal (QPOSCNT = QPOSINIT)  " range="9 - 8" rwaccess="RW"/> 
		<bitfield id="SWI" width="1" begin="7" end="7" resetval="0x0" description="Software init position counter    0   |   SWI_NOTHINGDo nothing (action disabled)      1   |   SWI_INITPOSInitialize position counter (QPOSCNT=QPOSINIT). This bit is not cleared automatically  " range="7" rwaccess="RW"/> 
		<bitfield id="SEL" width="1" begin="6" end="6" resetval="0x0" description="Strobe event latch of position counter    0   |   SEL_QEPSRISINGThe position counter is latched on the rising edge of QEPS strobe (QPOSSLAT = POSCCNT). Latching on the falling edge can be done by inverting the strobe input using the QSP bit in the QDECCTL register      1   |   SEL_QEPSCLOCKClockwise Direction: Position counter is latched on rising edge of QEPS strobe Counter Clockwise Direction: Position counter is latched on falling edge of QEPS strobe  " range="6" rwaccess="RW"/> 
		<bitfield id="IEL" width="2" begin="5" end="4" resetval="0x0" description="Index event latch of position counter (software index marker)    0x0   |   IEL_RSVDReserved      0x1   |   IEL_POSRISINGLatches position counter on rising edge of the index signal      0x2   |   IEL_POSFALLINGLatches position counter on falling edge of the index signal      0x3   |   IEL_SIMSoftware index marker. Latches the position counter and quadrature direction flag on index event marker. The position counter is latched to the QPOSILAT register and the direction flag is latched in the QEPSTS[QDLF] bit. This mode is useful for software index marking.  " range="5 - 4" rwaccess="RW"/> 
		<bitfield id="QPEN" width="1" begin="3" end="3" resetval="0x0" description="Quadrature position counter enable/software reset    0   |   QPEN_RESETReset the eQEP peripheral internal operating flags/read-only registers. Control/configuration registers are not disturbed by a software reset. When QPEN is disabled, some flags in the QFLG register do not get reset or cleared and show the actual state of that flag.      1   |   QPEN_ENABLEeQEP position counter is enabled  " range="3" rwaccess="RW"/> 
		<bitfield id="QCLM" width="1" begin="2" end="2" resetval="0x0" description="QEP capture latch mode    0   |   QCLM_CPULatch on position counter read by CPU. Capture timer and capture period values are latched into QCTMRLAT and QCPRDLAT registers when CPU reads the QPOSCNT register.      1   |   QCLM_TIMEOUTLatch on unit time out. Position counter, capture timer and capture period values are latched into QPOSLAT, QCTMRLAT and QCPRDLAT registers on unit time out.  " range="2" rwaccess="RW"/> 
		<bitfield id="UTE" width="1" begin="1" end="1" resetval="0x0" description="QEP unit timer enable    0   |   UTE_DISABLEDisable eQEP unit timer      1   |   UTE_ENABLEEnable unit timer  " range="1" rwaccess="RW"/> 
		<bitfield id="WDE" width="1" begin="0" end="0" resetval="0x0" description="QEP watchdog enable    0   |   WDE_DISABLEDisable the eQEP watchdog timer      1   |   WDE_ENABLEEnable the eQEP watchdog timer  " range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QCAPCTL" acronym="CONTROLSS_EQEP1_QCAPCTL" offset="0x2C" width="16" description="">
		<bitfield id="CEN" width="1" begin="15" end="15" resetval="0x0" description="Enable eQEP capture    0   |   CEN_DISABLEeQEP capture unit is disabled      1   |   CEN_ENABLEeQEP capture unit is enabled  " range="15" rwaccess="RW"/> 
		<bitfield id="CCPS" width="3" begin="6" end="4" resetval="0x0" description="eQEP capture timer clock prescaler    0x0   |   SYSCLKOUT1CAPCLK = SYSCLKOUT/1      0x1   |   SYSCLKOUT2CAPCLK = SYSCLKOUT/2      0x2   |   SYSCLKOUT4CAPCLK = SYSCLKOUT/4      0x3   |   SYSCLKOUT8CAPCLK = SYSCLKOUT/8      0x4   |   SYSCLKOUT16CAPCLK = SYSCLKOUT/16      0x5   |   SYSCLKOUT32CAPCLK = SYSCLKOUT/32      0x6   |   SYSCLKOUT64CAPCLK = SYSCLKOUT/64      0x7   |   SYSCLKOUT128CAPCLK = SYSCLKOUT/128  " range="6 - 4" rwaccess="RW"/> 
		<bitfield id="UPPS" width="4" begin="3" end="0" resetval="0x0" description="Unit position event prescaler    0x0   |   QCLK1UPEVNT = QCLK/1      0x1   |   QCLK2UPEVNT = QCLK/2      0x2   |   QCLK4UPEVNT = QCLK/4      0x3   |   QCLK8UPEVNT = QCLK/8      0x4   |   QCLK16UPEVNT = QCLK/16      0x5   |   QCLK32UPEVNT = QCLK/32      0x6   |   QCLK64UPEVNT = QCLK/64      0x7   |   QCLK128UPEVNT = QCLK/128      0x8   |   QCLK256UPEVNT = QCLK/256      0x9   |   QCLK512UPEVNT = QCLK/512      0xA   |   QCLK1024UPEVNT = QCLK/1024      0xB   |   QCLK2048UPEVNT = QCLK/2048      0xC   |   QCLK_RSVD0Reserved      0xD   |   QCLK_RSVD1Reserved      0xE   |   QCLK_RSVD2Reserved      0xF   |   QCLK_RSVD3Reserved  " range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QPOSCTL" acronym="CONTROLSS_EQEP1_QPOSCTL" offset="0x2E" width="16" description="">
		<bitfield id="PCSHDW" width="1" begin="15" end="15" resetval="0x0" description="Position compare of shadow enable    0   |   PCSHDW_DISABLEShadow disabled, load Immediate      1   |   PCSHDW_ENABLEShadow enabled  " range="15" rwaccess="RW"/> 
		<bitfield id="PCLOAD" width="1" begin="14" end="14" resetval="0x0" description="Position compare of shadow load    0   |   PCLOAD_0Load on QPOSCNT = 0      1   |   PCLOAD_QPOSCMPLoad when QPOSCNT = QPOSCMP  " range="14" rwaccess="RW"/> 
		<bitfield id="PCPOL" width="1" begin="13" end="13" resetval="0x0" description="Polarity of sync output    0   |   PCPOL_HIGHActive HIGH pulse output      1   |   PCPOL_LOWActive LOW pulse output  " range="13" rwaccess="RW"/> 
		<bitfield id="PCE" width="1" begin="12" end="12" resetval="0x0" description="Position compare enable/disable    0   |   PCE_DISABLEDisable position compare unit      1   |   PCE_ENABLEEnable position compare unit  " range="12" rwaccess="RW"/> 
		<bitfield id="PCSPW" width="12" begin="11" end="0" resetval="0x0" description="Select-position-compare sync output pulse width    0x000   |   SYSCLKOUT41 * 4 * SYSCLKOUT cycles      0x001   |   SYSCLKOUT82 * 4 * SYSCLKOUT cycles      0xFFF   |   SYSCLKOUT163844096 * 4 * SYSCLKOUT cycles  " range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QEINT" acronym="CONTROLSS_EQEP1_QEINT" offset="0x30" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error Interrupt enable    0   |   QMAE_DISABLEInterrupt is disabled      1   |   QMAE_ENABLEInterrupt is enabled  " range="12" rwaccess="RW"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt enable    0   |   UTO_DISABLEInterrupt is disabled      1   |   UTO_ENABLEInterrupt is enabled  " range="11" rwaccess="RW"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt enable    0   |   IEL_DISABLEInterrupt is disabled      1   |   IEL_ENABLEInterrupt is enabled  " range="10" rwaccess="RW"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt enable    0   |   SEL_DISABLEInterrupt is disabled      1   |   SEL_ENABLEInterrupt is enabled  " range="9" rwaccess="RW"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Position-compare match interrupt enable    0   |   PCM_DISABLEInterrupt is disabled      1   |   PCM_ENABLEInterrupt is enabled  " range="8" rwaccess="RW"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt enable    0   |   PCR_DISABLEInterrupt is disabled      1   |   PCR_ENABLEInterrupt is enabled  " range="7" rwaccess="RW"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt enable    0   |   PCO_DISABLEInterrupt is disabled      1   |   PCO_ENABLEInterrupt is enabled  " range="6" rwaccess="RW"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt enable    0   |   PCU_DISABLEInterrupt is disabled      1   |   PCU_ENABLEInterrupt is enabled  " range="5" rwaccess="RW"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog time out interrupt enable    0   |   WTO_DISABLEInterrupt is disabled      1   |   WTO_ENABLEInterrupt is enabled  " range="4" rwaccess="RW"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt enable    0   |   QDC_DISABLEInterrupt is disabled      1   |   QDC_ENABLEInterrupt is enabled  " range="3" rwaccess="RW"/> 
		<bitfield id="QPE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt enable    0   |   QPE_DISABLEInterrupt is disabled      1   |   QPE_ENABLEInterrupt is enabled  " range="2" rwaccess="RW"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt enable    0   |   PCE_DISABLEInterrupt is disabled      1   |   PCE_ENABLEInterrupt is enabled  " range="1" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QFLG" acronym="CONTROLSS_EQEP1_QFLG" offset="0x32" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error interrupt flag    Read0   |   QMAE_NOFLAGNo interrupt generated      Read1   |   QMAE_FLAGInterrupt was generated  " range="12" rwaccess="RO"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt flag    Read0   |   UTO_NOFLAGNo interrupt generated      Read1   |   UTO_FLAGSet by eQEP unit timer period match  " range="11" rwaccess="RO"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt flag    Read0   |   IEL_NOFLAGNo interrupt generated      Read1   |   IEL_FLAGThis bit is set after latching the QPOSCNT to QPOSILAT  " range="10" rwaccess="RO"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt flag    Read0   |   SEL_NOFLAGNo interrupt generated      Read1   |   SEL_FLAGThis bit is set after latching the QPOSCNT to QPOSSLAT  " range="9" rwaccess="RO"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="eQEP compare match event interrupt flag    Read0   |   PCM_NOFLAGNo interrupt generated      Read1   |   PCM_FLAGThis bit is set on position-compare match  " range="8" rwaccess="RO"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt flag    Read0   |   PCR_NOFLAGNo interrupt generated      Read1   |   PCR_FLAGThis bit is set after transferring the shadow register value to the active position compare register  " range="7" rwaccess="RO"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt flag    Read0   |   PCO_NOFLAGNo interrupt generated      Read1   |   PCO_FLAGThis bit is set on position counter overflow.  " range="6" rwaccess="RO"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt flag    Read0   |   PCU_NOFLAGNo interrupt generated      Read1   |   PCU_FLAGThis bit is set on position counter underflow.  " range="5" rwaccess="RO"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog timeout interrupt flag    Read0   |   WTO_NOFLAGNo interrupt generated      Read1   |   WTO_FLAGSet by watchdog timeout  " range="4" rwaccess="RO"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt flag    Read0   |   QDC_NOFLAGNo interrupt generated      Read1   |   QDC_FLAGInterrupt was generated  " range="3" rwaccess="RO"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt flag    Read0   |   PHE_NOFLAGNo interrupt generated      Read1   |   PHE_FLAGSet on simultaneous transition of QEPA and QEPB  " range="2" rwaccess="RO"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt flag    Read0   |   PCE_NOFLAGNo interrupt generated      Read1   |   PCE_FLAGPosition counter error  " range="1" rwaccess="RO"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt status flag    Read0   |   INT_NOFLAGNo interrupt generated      Read1   |   INT_FLAGInterrupt was generated  " range="0" rwaccess="RO"/>
	</register>
