IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_EQEP1_CONTROLSS_EQEP1.xml
	<register id="CONTROLSS_EQEP1_QCLR" acronym="CONTROLSS_EQEP1_QCLR" offset="0x34" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Clear QMA Error interrupt flag    0   |   QMAE_NOEFFECTNo effect      1   |   QMAE_CLRClears the interrupt flag  " range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Clear unit time out interrupt flag    0   |   UTO_NOEFFECTNo effect      1   |   UTO_CLRClears the interrupt flag  " range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Clear index event latch interrupt flag    0   |   IEL_NOEFFECTNo effect      1   |   IEL_CLRClears the interrupt flag  " range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Clear strobe event latch interrupt flag    0   |   SEL_NOEFFECTNo effect      1   |   SEL_CLRClears the interrupt flag  " range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Clear eQEP compare match event interrupt flag    0   |   PCM_NOEFFECTNo effect      1   |   PCM_CLRClears the interrupt flag  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Clear position-compare ready interrupt flag    0   |   PCR_NOEFFECTNo effect      1   |   PCR_CLRClears the interrupt flag  " range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Clear position counter overflow interrupt flag    0   |   PCO_NOEFFECTNo effect      1   |   PCO_CLRClears the interrupt flag  " range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Clear position counter underflow interrupt flag    0   |   PCU_NOEFFECTNo effect      1   |   PCU_CLRClears the interrupt flag  " range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Clear watchdog timeout interrupt flag    0   |   WTO_NOEFFECTNo effect      1   |   WTO_CLRClears the interrupt flag  " range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Clear quadrature direction change interrupt flag    0   |   QDC_NOEFFECTNo effect      1   |   QDC_CLRClears the interrupt flag  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Clear quadrature phase error interrupt flag    0   |   PHE_NOEFFECTNo effect      1   |   PHE_CLRClears the interrupt flag  " range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Clear position counter error interrupt flag    0   |   PCE_NOEFFECTNo effect      1   |   PCE_CLRClears the interrupt flag  " range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt clear flag    0   |   INT_NOEFFECTNo effect      1   |   INT_CLRClears the interrupt flag  " range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_EQEP1_QFRC" acronym="CONTROLSS_EQEP1_QFRC" offset="0x36" width="16" description="">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Force QMA error interrupt    0   |   QMAE_NOEFFECTNo effect      1   |   QMAE_FORCEForce the interrupt  " range="12" rwaccess="RW"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Force unit time out interrupt    0   |   UTO_NOEFFECTNo effect      1   |   UTO_FORCEForce the interrupt  " range="11" rwaccess="RW"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Force index event latch interrupt    0   |   IEL_NOEFFECTNo effect      1   |   IEL_FORCEForce the interrupt  " range="10" rwaccess="RW"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Force strobe event latch interrupt    0   |   SEL_NOEFFECTNo effect      1   |   SEL_FORCEForce the interrupt  " range="9" rwaccess="RW"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Force position-compare match interrupt    0   |   PCM_NOEFFECTNo effect      1   |   PCM_FORCEForce the interrupt  " range="8" rwaccess="RW"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Force position-compare ready interrupt    0   |   PCR_NOEFFECTNo effect      1   |   PCR_FORCEForce the interrupt  " range="7" rwaccess="RW"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Force position counter overflow interrupt    0   |   PCO_NOEFFECTNo effect      1   |   PCO_FORCEForce the interrupt  " range="6" rwaccess="RW"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Force position counter underflow interrupt    0   |   PCU_NOEFFECTNo effect      1   |   PCU_FORCEForce the interrupt  " range="5" rwaccess="RW"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Force watchdog time out interrupt    0   |   WTO_NOEFFECTNo effect      1   |   WTO_FORCEForce the interrupt  " range="4" rwaccess="RW"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Force quadrature direction change interrupt    0   |   QDC_NOEFFECTNo effect      1   |   QDC_FORCEForce the interrupt  " range="3" rwaccess="RW"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Force quadrature phase error interrupt    0   |   PHE_NOEFFECTNo effect      1   |   PHE_FORCEForce the interrupt  " range="2" rwaccess="RW"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Force position counter error interrupt    0   |   PCE_NOEFFECTNo effect      1   |   PCE_FORCEForce the interrupt  " range="1" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QEPSTS" acronym="CONTROLSS_EQEP1_QEPSTS" offset="0x38" width="16" description="">
		<bitfield id="UPEVNT" width="1" begin="7" end="7" resetval="0x1" description="Unit position event flag    0   |   UPEVNT_NODETCTNo unit position event detected      1   |   UPEVNT_DETCTUnit position event detected. Write 1 to clear  " range="7" rwaccess="RW"/> 
		<bitfield id="FIDF" width="1" begin="6" end="6" resetval="0x0" description="Direction on the first index marker Status of the direction is latched on the first index event marker.    Read0   |   FIDF_COUNTERCLKCounter-clockwise rotation (or reverse movement) on the first index event      Read1   |   FIDF_CLKClockwise rotation (or forward movement) on the first index event  " range="6" rwaccess="RO"/> 
		<bitfield id="QDF" width="1" begin="5" end="5" resetval="0x0" description="Quadrature direction flag    Read0   |   QDF_COUNTERCLKCounter-clockwise rotation (or reverse movement)      Read1   |   QDF_CLKClockwise rotation (or forward movement)  " range="5" rwaccess="RO"/> 
		<bitfield id="QDLF" width="1" begin="4" end="4" resetval="0x0" description="eQEP direction latch flag    Read0   |   QDLF_COUNTERCLKCounter-clockwise rotation (or reverse movement) on index event marker      Read1   |   QDLF_CLKClockwise rotation (or forward movement) on index event marker  " range="4" rwaccess="RO"/> 
		<bitfield id="COEF" width="1" begin="3" end="3" resetval="0x0" description="Capture overflow error flag    0   |   COEF_WRT1Overflow has not occurred.      1   |   COEF_OVFOverflow occurred in eQEP Capture timer (QEPCTMR). This bit is cleared by writing a '1'.  " range="3" rwaccess="RW"/> 
		<bitfield id="CDEF" width="1" begin="2" end="2" resetval="0x0" description="Capture direction error flag    0   |   CDEF_WRT1Capture direction error has not occurred.      1   |   CDEF_DIRECTDirection change occurred between the capture position event. This bit is cleared by writing a '1'.  " range="2" rwaccess="RW"/> 
		<bitfield id="FIMF" width="1" begin="1" end="1" resetval="0x0" description="First index marker flag    0   |   FIMF_WRT1First index pulse has not occurred.      1   |   FIMF_SETINDEXSet by first occurrence of index pulse.  This bit is cleared by writing a '1'.  " range="1" rwaccess="RW"/> 
		<bitfield id="PCEF" width="1" begin="0" end="0" resetval="0x0" description="Position counter error flag.  This bit is not sticky and it is updated for every index event.    Read0   |   PCEF_NOERRORNo error occurred during the last index transition      Read1   |   PCEF_ERRORPosition counter error  " range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_EQEP1_QCTMR" acronym="CONTROLSS_EQEP1_QCTMR" offset="0x3A" width="16" description="">
		<bitfield id="QCTMR" width="16" begin="15" end="0" resetval="0x0" description="This register provides time base for edge capture unit." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_EQEP1_QCPRD" acronym="CONTROLSS_EQEP1_QCPRD" offset="0x3C" width="16" description="">
		<bitfield id="QCPRD" width="16" begin="15" end="0" resetval="0x0" description="This register holds the period count value between the last successive eQEP position events" range="15 - 0" rwaccess="RW"/>
	</register>
